# Space

## Description
Procedure Space writes a space to the current output file.

```pascal
PROCEDURE Space(n : INTEGER);
```

```python
def vs.Space(n):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|n|INTEGER|Number of spaces.|

## Examples
#### VectorScript ####
```pascal
Space(5);
{write 5 spaces to the output file}
```
#### Python ####
```python

```

```pascal
Space(1);
```
```python
vs.Space(n)
```

## Version
Availability: from All Versions

## Category
* File I@O